Австралия/src/InformationRegisters/AccountingTransactionGenerationSettings/AccountingTransactionGenerationSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>AccountingTransactionGenerationSettings</name>
  <resources>
    <name>Enabled</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Author</name>
    <comment>Author - user who added the element</comment>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>ScheduledJobUUID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>TypeOfAccounting</name>
    <type>
      <types>CatalogRef.TypesOfAccounting</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Mode</name>
    <type>
      <types>EnumRef.AccountingTransactionGenerationMode</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/AccountingTransactionGenerationSettings/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventHandlers

Procedure BeforeWrite(Cancel, Replacing)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Modified() And Count() = 0 Then
		
		Query = New Query;
		Query.Text = 
		"SELECT
		|	AccountingTransactionGenerationSettings.ScheduledJobUUID AS ScheduledJobUUID
		|FROM
		|	InformationRegister.AccountingTransactionGenerationSettings AS AccountingTransactionGenerationSettings
		|WHERE
		|	AccountingTransactionGenerationSettings.Company = &Company
		|	AND AccountingTransactionGenerationSettings.TypeOfAccounting = &TypeOfAccounting";
		
		Query.SetParameter("Company"			, Filter.Company.Value);
		Query.SetParameter("TypeOfAccounting"	, Filter.TypeOfAccounting.Value);
		
		QueryResult = Query.Execute();
		
		SelectionDetailRecords = QueryResult.Select();
		
		While SelectionDetailRecords.Next() Do
			
			If ValueIsFilled(SelectionDetailRecords.ScheduledJobUUID) Then
				
				Job = ScheduledJobsServer.Job(SelectionDetailRecords.ScheduledJobUUID);
				
				If Job <> Undefined Then
					ScheduledJobsServer.DeleteJob(Job);
				EndIf;
				
			EndIf;
			
		EndDo;
		
	EndIf;

EndProcedure

#EndRegion

#EndIf
